# Урок "Принятие функций"

# Инициализация функции def() и называем его "main"
# Внутри два аргумента (a, b) / Кол-во аргументов не ограничено
# Аргумент в коде - это параметры (значения),
# что вы передаете для дальнейшего использования его в функции/def
def main(a, b):

    # Возвращаем сумму a, b
    return a + b

# Просим функцию запуститься
main(1, 2)
# Мы лишь ввели, что вызываем функцию,
# но то, что возвращается из функции не выводится. Как иправить?

print(main(1, 2))
# Принтим/выводим и запускаем функцию!
# ИЛИ
result = main(1, 2)
print(result)
# Записываем ответ функции в переменную
# и потом выводим эту переменную!

# (Выдал два варианта решения проблемы с выводом)

# Выводит ответ: 3

# ДЗ - Напиши функцию, что принимает две буквы и соединяет их
# не путай int и strings