# Урок "Персонаж"

# Инициализируем/создаем фунцкию def() под названием "character" (персонаж)
# Передаем ему аргумент "name" (имя)
def character(name):

    # Возвращаем приветствие состоящее из строк
    # и наших аргументом (в данном случаее один аргумент - name)
    return "Привет, " + name + "!"

# Вызываем функцию и сразу выводим то,
# что возвращает функцию (не забудьте указать значение нашему аргументу!)
print(character("Max"))

# Вывод таков:
# Привет, Max!

# ДЗ - написать функцию, что выводит имя и возраст вашего персонажа
# Формат: "Привет, (name)! Я знаю, что тебе (age) лет!"