# Урок "Юзер - наш указатель"

# Юзер имеет право на интерактивность
# и взаимодействие с программой в целом! (Адаптивность)

# Инициализируем/создаем функцию def() и называем - "yourCharacter"
# Прошу заметить, мы не передаем аргументы!
def yourCharacter():

    # Запрашиваем у пользователя имя и возраст
    name = input("Введите имя персонажа: ")
    age = input("Введите возраст персонажа: ")
    # Все, что написал пользователь
    # поочередно передается в эти переменные!

    # Выводим СРАЗУ всю информацию
    print("Имя персонажа: " + name + ", Возраст персонажа: " + age)


# Вызываем эту функцию и не передаем параметры,
# потому что функцию сама не принимает их
yourCharacter()

# Далее код отрабатывает по заготовленному сценарию в функции
# и прекращает свою работу

# Вывод таков:
# Введите имя персонажа: Character
# Введите возраст персонажа: 18
# Имя персонажа: Character, Возраст персонажа: 18

# ДЗ - напиши функцию, что запрашивает почту и пароль пользователя
# Далее выводит его как в нашем примере!ы