# Урок "Взаимодействие между функциями"

# Каждая функцию выполняет СВОИ задачи
# и мы можем данные, что возвращаются из функциюю передавать в последующие функции

# (нам это пригодится для нашей игры!)

# Инициализируем/создаем нашу первую функцию def() и называем ее "characterName"
# Опять-же, он у нас без аргументов/параметров
def characterName():

    # Запрашиваем имя у юзера
    name = input("Введите имя персонажа: ")

    # Возвращаем переменную имени, что ввел пользователь
    return name

# Инициализируем/создаем нашу вторую функцию def() и называем ее "characterHello"
# Вот он уже принимает имя нашего персонажа, а сама функцию выполняет отправку приветствия нашмеу персонажу
def characterHello(name):

    # Выводим приветствие с передачей аргумента
    print("Привет, " + name + "!")


# В переменной name (имя) мы вызываем функцию characterName
# и то, что возвращает функцию -> переносится в эту переменную (name)
name = characterName()

# Вызываем функцию characterHello и передаем как параметр нашу прошлую переменную
# что хранит имя (name) нашего персонажа
characterHello(name)

# Вывод таков:
# Введите имя персонажа: Character
# Привет, Character!

# ДЗ - напишите подобную логику, но уже в рамках вашей фантазии!