# Урок "Функция и дружба с условиями"

# Что-то мы зациклились на персонаже и запросами к нему!
# Сейчас мы напишем функцию, что принимает наш возраст
# и проводит проверку на совершеннолетие

# Представим, что мы хотим попасть в клуб
# но на входе стоит охранник и просматривает паспорта
# конечно-же, чтобы удостовериться в совершеннолетии

# И наша функцию будет выполнять ту же роль!

# Инициализируем/создаем нашу первую функцию def() и называем ее "ageChecker"
# Он принимает у нас наш возраст, следовательно - параметр (age)

def ageChecker(age):

    # Если возраст будет БОЛЬШЕ/РАВНО 18 : Вход разрешен! Вы совершеннолетний!
    if age >= 18:
        print("Вход разрешен! Вы совершеннолетний!")

    # Иначе : Вы несовершеннолетний!
    else:
        print("Вы несовершеннолетний!")


# Запрашиваем у пользователя указать возраст
# Обратите внимание, я написал int(input())
# это было сделано для более строгой проверки введенного пользователем
# то есть, если пользователь введет слово, а не свой возраст, что в формате чисел
# то программа выдаст ошибку! (используйте подобную конструкцию, если проверка строгая)
age = int(input("Введите свой возраст: "))

# Вызываем функцию и передаем туда то, что ввел пользователь
ageChecker(age)

# Вопрос для закрепления: почему мы передаем параметр "age" при запуске функции?

# Вывод таков:
# Введите свой возраст: 18
# Вход разрешен! Вы совершеннолетний!

# ДЗ - напишите свою функцию, что будет проверять возраст,
# но с более строгой проверкой!

# Небольшая памятка для ДЗ
# == - СРАВНЕНИЕ
# != - ОТРИЦАТЕЛЬНОЕ СРАВНЕНИЕ
# <= - МЕНЬШЕ/РАВНО
# >= - БОЛЬШЕ/РАВНО

# Ваша задача понять, где подобное можно использовать