# Урок "Игра - вариация фантазии"

# Функции выполняют отдельные свои части кода,
# что могут нести разный смысл действий, но и иметь логическую цепочку действий
# и это играет нам на руку, ведь теперь мы можем написать мини-игру с помощью функций!

# План такой:
# Мы создаем запросы к пользователю с сбором информации о нашем персонаже
# Создаем функцию для очистки терминала
# Создаем функцию для атаки босса
# Создаем функцию для лечения нашего персонажа

# Также уточню, что мы используем 2 библиотеки для:
# 1. Установки времени перехода между функциями (import time)
# 2. Очистки терминала после выполнения действия (import os)

# Импортируем/Добавляем эти библиотеки/модули в наш файл
import os
import time


# Создаем функцию, что просто при вызове будет отсчитывать 2 секунды
# и очищать терминал
def timeToClear():

    # time имеет метод .sleep(секунды), который временно задерживает код
    time.sleep(2)
    # os имеет метод .system(команда), которая может выполнить любую терминальную команду
    # ("cls") внутри метода - это буквально "clear" (то есть, все что в программе)
    # - мгновенно стирается
    os.system("cls")


# Создаем функцию для атаки босса
def attack():

    # global - это слово, которое указывает на то,
    # что перемену можно изменять даже тогда, когда она вне функции/не в функции
    global boss_hp

    # Запрашиваем пользователя об уроне, что он хочет нанести (строгая проверка записиь)
    # - конструкция int(input())
    damage = int(input("Введите урон, что хотите нанести: "))

    # Вычитаем из здоровья босса наносимый нами урон
    boss_hp -= damage

    # Если здоровье босса МЕНЬШЕ/РАВНО 0 : Босс умер - мы победили!!!
    if boss_hp <= 0:
        print("Босс умер... Ты выиграл!!!")

        # Вызываем функцию для очистки
        timeToClear()

    # Иначе : атаковали босса - осталось здоровья
    else:

        # Прошу обратить внимание на " " + str(boss_hp) + " "
        # Мы использовали str(boss_hp), чтобы наше значение (число/int) перешло в (строку/str)
        # и мы смогли запихнуть его в наш вывод, иначе была-бы ошибка!
        print("Ты атаковал босса (У босса " + str(boss_hp) + "hp)")

        # Вызываем функцию для очистки
        timeToClear()

def heal():

    # Все тоже самое, что и с функцией attack()
    global character_hp

    heal_amount = int(input("Введите на сколько hp хотите вылечиться: "))
    if character_hp >= 100:
        print("У тебя и так 100hp, куда больше?")
        timeToClear()
    else:

        if character_hp > 100:

            # Мы указали, что если здоровье нашего персонажа будет больше 100 после лечения
            # то сразу переопределяем его здоровье и превращаем в 100
            # (просто легонько ввели ограничение без усложнений)
            character_hp = 100

        print("Ты вылечился на " + str(heal_amount) + "!")
        timeToClear()




# Инициализируем/создаем конструкцию для старта
if __name__ == "__main__":

    # Инициализировали/создали базовые значения
    boss_hp = 100
    character_hp = 100

    # Конструкция " while True: "
    # - это просто бесконечный цикл, который вы в нашем случае
    # либо обрываете 3 опцией
    # либо ломаете ложными данными (на ваше понимание)
    while True:
        banner1 = "[1] Атаковать босса"
        banner2 = "[2] Вылечиться"
        banner3 = "[3] Выйти"
        print(banner1)
        print(banner2)
        print(banner3)

        choice = int(input("Выберите опцию: "))

        if choice == 1:
            attack()

        elif choice == 2:
            heal()

        elif choice == 3:
            print("Выходим...")
            time.sleep(2)

            # os._exit(0) - успешный выход из терминала
            os._exit(0)

        else:
            print("Такой опции не существует!")

# ДЗ - Написать свою схватку, но передать и использовать
# в атаке и в здоровье такой параметр как - "Имя" (name)